test/files/two_lines_one_invoice_shopware.csv

"orderId";"orderNumber";"invoiceNumber";"invoiceAmount";"invoiceAmountNet";"invoiceShipping";"invoiceShippingNet";"taxRateSums_0";"taxRateSums_5";"taxRateSums_6";"taxRateSums_7";"taxRateSums_8";"taxRateSums_9";"taxRateSums_9.5";"taxRateSums_10";"taxRateSums_11";"taxRateSums_12";"taxRateSums_13";"taxRateSums_13.5";"taxRateSums_14";"taxRateSums_15";"taxRateSums_16";"taxRateSums_17";"taxRateSums_18";"taxRateSums_19";"taxRateSums_20";"taxRateSums_21";"taxRateSums_22";"taxRateSums_23";"taxRateSums_24";"taxRateSums_25";"taxRateSums_27";"taxRateSums_28";"taxRateSums_32";"taxRateSums_40";"taxRateSums_42";"taxRateSums_47";"taxRateSums_51";"taxRateSums_58";"net";"taxFree";"paymentName";"paymentStatus";"orderStatus";"currency";"currencyFactor";"transactionId";"trackingCode";"orderTime";"email";"customerNumber";"customerGroup";"billingSalutation";"billingFirstName";"billingLastName";"billingCompany";"billingDepartment";"billingStreet";"billingZipCode";"billingCity";"billingPhone";"billingFax";"billingAdditionalAddressLine1";"billingAdditionalAddressLine2";"billingState";"billingCountry";"shippingSalutation";"shippingFirstName";"shippingLastName";"shippingCompany";"shippingDepartment";"shippingStreet";"shippingZipCode";"shippingCity";"shippingAdditionalAddressLine1";"shippingState";"shippingCountry"
87150;90067;6010;59,39;53,12;4,95;4,4387957362983;;;;"2.04";;;;;;;;;;;;;;"3.72";;;;;;;;;;;;;;;0;0;"PayPal";"Komplett bezahlt";"Komplett ausgeliefert";"EUR";1;"69F80084MV4555532";3,40E+17;"2022-10-26 07:07:07";"invoiced.customer@mail.com";6112;"Shopkunden";"mr";"FirsNameOf";"LastNameOfBill";;;"Hauptstraﬂe";22331;"Hamburg";;;2;;;"Deutschland";"mr";"FirstShippingName";"ShippingNameLast";;;"Hauptstraﬂe";22331;"Hamburg";2;;"Deutschland"
87151;0;;228,43;211,46;0;0;0;;;"14.12";;;;;;;;;;;;;;"2.85";;;;;;;;;;;;;;;0;0;"Auf Rechnung";"Offen";"Abgebrochen";"EUR";1;;;"2022-10-26 07:55:00";"not.invoiced.customer@mail.com";;"Shopkunden";;;;;;;;;;;;;;;;;;;;;;;;;
